In [2]:
from pyspark.sql import SparkSession

# Create a SparkSession
spark = SparkSession.builder.appName("https://github.com/maheshkshi400/MK").getOrCreate()

data1 = [(1,'mahesh','male',20,5000,'IT',50),
         (2,'shruthi','female',30,6000,'HR',20),
         (3,'ganesh','male',25,7000,'FINANCE',30),
         (4,'pooja','female',34,8000,'PAYROLL',40),
         (5,'kamini','female',31,6000,'IT',50)]

schema1 = ['id','name','gender','age','salary','dept','deptno']

data2 = [(1,'shivaji','male',20,8000,'IT',50),
         (2,'shruthi','female',30,6000,'HR',20),
         (3,'suresh','male',25,10000,'FINANCE',30),
         (4,'shivani','female',34,11000,'PAYROLL',40),
         (5,'prachi','female',30,6000,'IT',50),
         (5,'kamini','female',31,6000,'IT',50)]
schema2 = ['id','name','gender','age','salary','dept','deptno']

df1 = spark.createDataFrame(data1,schema1)
df2 = spark.createDataFrame(data2,schema2)

df1.show()
df2.show()

+---+-------+------+---+------+-------+------+
| id|   name|gender|age|salary|   dept|deptno|
+---+-------+------+---+------+-------+------+
|  1| mahesh|  male| 20|  5000|     IT|    50|
|  2|shruthi|female| 30|  6000|     HR|    20|
|  3| ganesh|  male| 25|  7000|FINANCE|    30|
|  4|  pooja|female| 34|  8000|PAYROLL|    40|
|  5| kamini|female| 31|  6000|     IT|    50|
+---+-------+------+---+------+-------+------+

+---+-------+------+---+------+-------+------+
| id|   name|gender|age|salary|   dept|deptno|
+---+-------+------+---+------+-------+------+
|  1|shivaji|  male| 20|  8000|     IT|    50|
|  2|shruthi|female| 30|  6000|     HR|    20|
|  3| suresh|  male| 25| 10000|FINANCE|    30|
|  4|shivani|female| 34| 11000|PAYROLL|    40|
|  5| prachi|female| 30|  6000|     IT|    50|
|  5| kamini|female| 31|  6000|     IT|    50|
+---+-------+------+---+------+-------+------+

In [3]:
df3 = df1.union(df2).show()

+---+-------+------+---+------+-------+------+
| id|   name|gender|age|salary|   dept|deptno|
+---+-------+------+---+------+-------+------+
|  1| mahesh|  male| 20|  5000|     IT|    50|
|  2|shruthi|female| 30|  6000|     HR|    20|
|  3| ganesh|  male| 25|  7000|FINANCE|    30|
|  4|  pooja|female| 34|  8000|PAYROLL|    40|
|  5| kamini|female| 31|  6000|     IT|    50|
|  1|shivaji|  male| 20|  8000|     IT|    50|
|  2|shruthi|female| 30|  6000|     HR|    20|
|  3| suresh|  male| 25| 10000|FINANCE|    30|
|  4|shivani|female| 34| 11000|PAYROLL|    40|
|  5| prachi|female| 30|  6000|     IT|    50|
|  5| kamini|female| 31|  6000|     IT|    50|
+---+-------+------+---+------+-------+------+

In [25]:
df4 = df1.unionAll(df2)
df4.show()

+---+-------+------+---+------+-------+------+
| id|   name|gender|age|salary|   dept|deptno|
+---+-------+------+---+------+-------+------+
|  1| mahesh|  male| 20|  5000|     IT|    50|
|  2|shruthi|female| 30|  6000|     HR|    20|
|  3| ganesh|  male| 25|  7000|FINANCE|    30|
|  4|  pooja|female| 34|  8000|PAYROLL|    40|
|  5| kamini|female| 31|  6000|     IT|    50|
|  1|shivaji|  male| 20|  8000|     IT|    50|
|  2|shruthi|female| 30|  6000|     HR|    20|
|  3| suresh|  male| 25| 10000|FINANCE|    30|
|  4|shivani|female| 34| 11000|PAYROLL|    40|
|  5| prachi|female| 30|  6000|     IT|    50|
|  5| kamini|female| 31|  6000|     IT|    50|
+---+-------+------+---+------+-------+------+

In [26]:

df5 = df4.dropDuplicates()
df5.show()

+---+-------+------+---+------+-------+------+
| id|   name|gender|age|salary|   dept|deptno|
+---+-------+------+---+------+-------+------+
|  1| mahesh|  male| 20|  5000|     IT|    50|
|  2|shruthi|female| 30|  6000|     HR|    20|
|  3| ganesh|  male| 25|  7000|FINANCE|    30|
|  4|  pooja|female| 34|  8000|PAYROLL|    40|
|  5| kamini|female| 31|  6000|     IT|    50|
|  1|shivaji|  male| 20|  8000|     IT|    50|
|  3| suresh|  male| 25| 10000|FINANCE|    30|
|  4|shivani|female| 34| 11000|PAYROLL|    40|
|  5| prachi|female| 30|  6000|     IT|    50|
+---+-------+------+---+------+-------+------+

In [27]:

columns_to_check_duplicates=['id','name','gender','age','salary','dept','deptno']
df5 = df4.dropDuplicates(subset=columns_to_check_duplicates)
df5.show()

+---+-------+------+---+------+-------+------+
| id|   name|gender|age|salary|   dept|deptno|
+---+-------+------+---+------+-------+------+
|  1| mahesh|  male| 20|  5000|     IT|    50|
|  2|shruthi|female| 30|  6000|     HR|    20|
|  3| ganesh|  male| 25|  7000|FINANCE|    30|
|  4|  pooja|female| 34|  8000|PAYROLL|    40|
|  5| kamini|female| 31|  6000|     IT|    50|
|  1|shivaji|  male| 20|  8000|     IT|    50|
|  3| suresh|  male| 25| 10000|FINANCE|    30|
|  4|shivani|female| 34| 11000|PAYROLL|    40|
|  5| prachi|female| 30|  6000|     IT|    50|
+---+-------+------+---+------+-------+------+